<details><summary>Digger run report at 2024-01-11 09:24:41 (UTC)</summary>
        <details><summary>Apply for <b>mileslee-nsuslab/quickstart-actions-aws#terraform_gp_2134_global_acm</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_vpc.vpc_network will be created
  + resource "aws_vpc" "vpc_network" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "terraform-network-np"
        }
      + tags_all                             = {
          + "Name" = "terraform-network-np"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
aws_vpc.vpc_network: Creating...
aws_vpc.vpc_network: Creation complete after 1s [id=vpc-032f6ee4894accd54]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

  ```
</details>

<details><summary>Apply for <b>mileslee-nsuslab/quickstart-actions-aws#terraform_gp_2134_global_ec2</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_vpc.vpc_network2 will be updated in-place
  ~ resource "aws_vpc" "vpc_network2" {
        id                                   = "vpc-0586bf8a861cad89e"
      ~ tags                                 = {
          ~ "Name" = "terraform-network" -> "terraform-network-np2"
        }
      ~ tags_all                             = {
          ~ "Name" = "terraform-network" -> "terraform-network-np2"
        }
        # (14 unchanged attributes hidden)
    }

  # aws_vpc.vpc_network3 will be destroyed
  # (because aws_vpc.vpc_network3 is not in configuration)
  - resource "aws_vpc" "vpc_network3" {
      - arn                                  = "arn:aws:ec2:us-east-1:893452408139:vpc/vpc-04a09234982a287df" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "10.0.0.0/16" -> null
      - default_network_acl_id               = "acl-0d4f017e53dc5274c" -> null
      - default_route_table_id               = "rtb-04409f35f7f3f44b9" -> null
      - default_security_group_id            = "sg-0c95c952c79969792" -> null
      - dhcp_options_id                      = "dopt-0208eaf712b863d90" -> null
      - enable_dns_hostnames                 = false -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-04a09234982a287df" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-04409f35f7f3f44b9" -> null
      - owner_id                             = "893452408139" -> null
      - tags                                 = {
          - "Name" = "terraform-network"
        } -> null
      - tags_all                             = {
          - "Name" = "terraform-network"
        } -> null
    }

Plan: 0 to add, 1 to change, 1 to destroy.
aws_vpc.vpc_network2: Modifying... [id=vpc-0586bf8a861cad89e]
aws_vpc.vpc_network3: Destroying... [id=vpc-04a09234982a287df]
aws_vpc.vpc_network3: Destruction complete after 0s
aws_vpc.vpc_network2: Modifications complete after 0s [id=vpc-0586bf8a861cad89e]

Apply complete! Resources: 0 added, 1 changed, 1 destroyed.

  ```
</details>


<details><summary>Apply for <b>mileslee-nsuslab/quickstart-actions-aws#terraform_gp_2134_global_vpc</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_vpc.vpc_network will be created
  + resource "aws_vpc" "vpc_network" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "terraform-network2"
        }
      + tags_all                             = {
          + "Name" = "terraform-network2"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
aws_vpc.vpc_network: Creating...
aws_vpc.vpc_network: Creation complete after 1s [id=vpc-0e427037338149dc7]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

  ```
</details>


<details><summary>Apply for <b>mileslee-nsuslab/quickstart-actions-aws#terraform_np_5455_global_vpc</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_vpc.vpc_network will be created
  + resource "aws_vpc" "vpc_network" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "terraform-network-np2"
        }
      + tags_all                             = {
          + "Name" = "terraform-network-np2"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
aws_vpc.vpc_network: Creating...
aws_vpc.vpc_network: Creation complete after 1s [id=vpc-0ddb026d98d74660d]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

  ```
</details>

</details>